#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_vpc.main: Refreshing state... [id=vpc-0c1f0c0c6e8f22c39]
aws_subnet.public_2: Refreshing state... [id=subnet-0a8a962e9db7288d3]
aws_subnet.private_1: Refreshing state... [id=subnet-074d9b837c4125d73]
aws_subnet.public_1: Refreshing state... [id=subnet-03dc4b554ef8026fa]
aws_subnet.private_2: Refreshing state... [id=subnet-05fb1ef90a6fa5d24]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_cluster.my_cluster will be created
  + resource "aws_eks_cluster" "my_cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "my-cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.my_node_group will be created
  + resource "aws_eks_node_group" "my_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "my-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "my-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # aws_iam_role.eks_node_role will be created
  + resource "aws_iam_role" "eks_node_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks_node_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.eks_role will be created
  + resource "aws_iam_role" "eks_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.eks_node_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "eks_node_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks_node_role"
    }

  # aws_iam_role_policy_attachment.eks_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "eks_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks_role"
    }

  # aws_security_group.eks_security_group will be created
  + resource "aws_security_group" "eks_security_group" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private_1 must be replaced
-/+ resource "aws_subnet" "private_1" {
      ~ arn                                            = "arn:aws:ec2:eu-north-1:459978891776:subnet/subnet-074d9b837c4125d73" -> (known after apply)
      ~ availability_zone_id                           = "eun1-az1" -> (known after apply)
      ~ cidr_block                                     = "192.168.128.0/24" -> "10.0.3.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-074d9b837c4125d73" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "459978891776" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"                      = "private-eu-north-1a"
            "kubernetes.io/cluster/eks" = "shared"
            "kubernetes.io/role/elb"    = "1"
        }
      ~ vpc_id                                         = "vpc-0c1f0c0c6e8f22c39" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private_2 must be replaced
-/+ resource "aws_subnet" "private_2" {
      ~ arn                                            = "arn:aws:ec2:eu-north-1:459978891776:subnet/subnet-05fb1ef90a6fa5d24" -> (known after apply)
      ~ availability_zone_id                           = "eun1-az2" -> (known after apply)
      ~ cidr_block                                     = "192.168.192.0/24" -> "10.0.4.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-05fb1ef90a6fa5d24" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "459978891776" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"                      = "private-eu-north-1b"
            "kubernetes.io/cluster/eks" = "shared"
            "kubernetes.io/role/elb"    = "1"
        }
      ~ vpc_id                                         = "vpc-0c1f0c0c6e8f22c39" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_1 must be replaced
-/+ resource "aws_subnet" "public_1" {
      ~ arn                                            = "arn:aws:ec2:eu-north-1:459978891776:subnet/subnet-03dc4b554ef8026fa" -> (known after apply)
      ~ availability_zone_id                           = "eun1-az1" -> (known after apply)
      ~ cidr_block                                     = "192.168.0.0/24" -> "10.0.1.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-03dc4b554ef8026fa" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "459978891776" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"                      = "public-eu-north-1a"
            "kubernetes.io/cluster/eks" = "shared"
            "kubernetes.io/role/elb"    = "1"
        }
      ~ vpc_id                                         = "vpc-0c1f0c0c6e8f22c39" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_2 must be replaced
-/+ resource "aws_subnet" "public_2" {
      ~ arn                                            = "arn:aws:ec2:eu-north-1:459978891776:subnet/subnet-0a8a962e9db7288d3" -> (known after apply)
      ~ availability_zone_id                           = "eun1-az2" -> (known after apply)
      ~ cidr_block                                     = "192.168.64.0/24" -> "10.0.2.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0a8a962e9db7288d3" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "459978891776" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"                      = "public-eu-north-1b"
            "kubernetes.io/cluster/eks" = "shared"
            "kubernetes.io/role/elb"    = "1"
        }
      ~ vpc_id                                         = "vpc-0c1f0c0c6e8f22c39" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_vpc.main must be replaced
-/+ resource "aws_vpc" "main" {
      ~ arn                                  = "arn:aws:ec2:eu-north-1:459978891776:vpc/vpc-0c1f0c0c6e8f22c39" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "192.168.0.0/16" -> "10.0.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-0abbe5b271d6715b0" -> (known after apply)
      ~ default_route_table_id               = "rtb-01f4a8b5c3a83bcaf" -> (known after apply)
      ~ default_security_group_id            = "sg-043c1d239945ba9e4" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-04e085b61cd12ec0e" -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-0c1f0c0c6e8f22c39" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-01f4a8b5c3a83bcaf" -> (known after apply)
      ~ owner_id                             = "459978891776" -> (known after apply)
        tags                                 = {
            "Name" = "main"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 12 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  ~ vpc_id = "vpc-0c1f0c0c6e8f22c39" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Gluppe, Action: `pull_request`*